--ЗАВДАННЯ 3
--Створити вью, який буде виводити всі червоні фабії в центральній Україні, та всі дані про них!

create or replace view red_fabia_in_central_ukraine as
	select * 
	from data_cars_temp , tsc_adres 
	where 
	color = 'ЧЕРВОНИЙ' and 
	brand = 'SKODA' and 
	model = 'FABIA' and
	number_tsc = ANY(ARRAY['ТСЦ 3541', 'ТСЦ 3542', 'ТСЦ 3543', 'ТСЦ 3544', 'ТСЦ 3545', 'ТСЦ 8041', 'ТСЦ 8042', 'ТСЦ 8043', 'ТСЦ 8044', 'ТСЦ 8045', 'ТСЦ 8046', 'ТСЦ 8047', 'ТСЦ 8048', 'ТСЦ 8049', 'ТСЦ 3241', 'ТСЦ 3242', 'ТСЦ 3243', 'ТСЦ 3244', 'ТСЦ 3245', 'ТСЦ 3246', 'ТСЦ 3247','ТСЦ 3248','ТСЦ 3249', 'ТСЦ 5141', 'ТСЦ 5142', 'ТСЦ 5143', 'ТСЦ 5144','ТСЦ 5145', 'ТСЦ 5146', 'ТСЦ 5147', 'ТСЦ 5148', 'ТСЦ 5149', 'ТСЦ 5150', 'ТСЦ 5151','ТСЦ 5152','ТСЦ 5153','ТСЦ 5154']
	);
select * from red_fabia_in_central_ukraine


